## Get the Data

Either use the provided .csv file or (optionally) get fresh (the freshest?) data from running an SQL query on StackExchange: 

Follow this link to run the query from [StackExchange](https://data.stackexchange.com/stackoverflow/query/675441/popular-programming-languages-per-over-time-eversql-com) to get your own .csv file

<code>
select dateadd(month, datediff(month, 0, q.CreationDate), 0) m, TagName, count(*)
from PostTags pt
join Posts q on q.Id=pt.PostId
join Tags t on t.Id=pt.TagId
where TagName in ('java','c','c++','python','c#','javascript','assembly','php','perl','ruby','visual basic','swift','r','object-c','scratch','go','swift','delphi')
and q.CreationDate < dateadd(month, datediff(month, 0, getdate()), 0)
group by dateadd(month, datediff(month, 0, q.CreationDate), 0), TagName
order by dateadd(month, datediff(month, 0, q.CreationDate), 0)
</code>

## Import Statements

In [6]:
import pandas as pd

file_path = r"C:\Users\Mohamad Family\Desktop\100 Days of Code  Python\Github\100-Days-of-Code-Python\Day 72 - Data Visualisation with Matplotlib\QueryResults.csv"

## Data Exploration

**Challenge**: Read the .csv file and store it in a Pandas dataframe

In [8]:
df = pd.read_csv(file_path)

**Challenge**: Examine the first 5 rows and the last 5 rows of the of the dataframe

In [12]:
df.head()

                     m   TagName  Unnamed: 2
0  2008-07-01 00:00:00        c#           3
1  2008-08-01 00:00:00  assembly           8
2  2008-08-01 00:00:00         c          83
3  2008-08-01 00:00:00        c#         505
4  2008-08-01 00:00:00       c++         164

In [13]:
df.tail()

                        m TagName  Unnamed: 2
2519  2023-09-01 00:00:00     php        1698
2520  2023-09-01 00:00:00  python        8776
2521  2023-09-01 00:00:00       r        2051
2522  2023-09-01 00:00:00    ruby         192
2523  2023-09-01 00:00:00   swift         887

**Challenge:** Check how many rows and how many columns there are. 
What are the dimensions of the dataframe?

In [15]:
df.shape

(2524, 3)

**Challenge**: Count the number of entries in each column of the dataframe

In [16]:
df.count()

m             2524
TagName       2524
Unnamed: 2    2524
dtype: int64

**Challenge**: Calculate the total number of post per language.
Which Programming language has had the highest total number of posts of all time?

In [42]:
# Solution from lesson
df.groupby('TagName').sum()

                                                            m  Unnamed: 2
TagName
assembly    2008-08-01 00:00:002008-09-01 00:00:002008-10-...       43314
c           2008-08-01 00:00:002008-09-01 00:00:002008-10-...      399407
c#          2008-07-01 00:00:002008-08-01 00:00:002008-09-...     1601769
c++         2008-08-01 00:00:002008-09-01 00:00:002008-10-...      798911
delphi      2008-08-01 00:00:002008-09-01 00:00:002008-10-...       51260
go          2009-11-01 00:00:002009-12-01 00:00:002010-01-...       70849
java        2008-08-01 00:00:002008-09-01 00:00:002008-10-...     1905406
javascript  2008-08-01 00:00:002008-09-01 00:00:002008-10-...     2509742
perl        2008-08-01 00:00:002008-09-01 00:00:002008-10-...       67857
php         2008-08-01 00:00:002008-09-01 00:00:002008-10-...     1459959
python      2008-08-01 00:00:002008-09-01 00:00:002008-10-...     2160111
r           2008-09-01 00:00:002008-11-01 00:00:002008-12-...      497052
ruby        2008-08-01 00:00:002008-09-01 00:00:002008-10-...      228391
swift       2009-01-01 00:00:002009-02-01 00:00:002009-03-...      329879

In [29]:
df.groupby('TagName').size()

TagName
assembly      182
c             182
c#            183
c++           182
delphi        182
go            167
java          182
javascript    182
perl          182
php           182
python        182
r             180
ruby          182
swift         174
dtype: int64

Some languages are older (e.g., C) and other languages are newer (e.g., Swift). The dataset starts in September 2008.

**Challenge**: How many months of data exist per language? Which language had the fewest months with an entry?

In [30]:
df.groupby('TagName').count()

              m  Unnamed: 2
TagName
assembly    182         182
c           182         182
c#          183         183
c++         182         182
delphi      182         182
go          167         167
java        182         182
javascript  182         182
perl        182         182
php         182         182
python      182         182
r           180         180
ruby        182         182
swift       174         174

## Data Cleaning

Let's fix the date format to make it more readable. We need to use Pandas to change format from a string of "2008-07-01 00:00:00" to a datetime object with the format of "2008-07-01"

In [51]:
# rename columns
df.rename(columns={'TagName': 'TAG', 'm': 'DATE', 'Unnamed: 2': 'POSTS'}, inplace=True)
df.head()

                  DATE       TAG  POSTS
0  2008-07-01 00:00:00        c#      3
1  2008-08-01 00:00:00  assembly      8
2  2008-08-01 00:00:00         c     83
3  2008-08-01 00:00:00        c#    505
4  2008-08-01 00:00:00       c++    164

In [55]:
print(df.DATE[1])
print(df['DATE'][1])
type(df['DATE'][1])

2008-08-01 00:00:00
2008-08-01 00:00:00

str

In [56]:
print(pd.to_datetime(df['DATE'][1]))
type(pd.to_datetime(df['DATE'][1]))

2008-08-01 00:00:00

pandas._libs.tslibs.timestamps.Timestamp

In [57]:
df['DATE'] = pd.to_datetime(df['DATE'])
df.head()

        DATE       TAG  POSTS
0 2008-07-01        c#      3
1 2008-08-01  assembly      8
2 2008-08-01         c     83
3 2008-08-01        c#    505
4 2008-08-01       c++    164

## Data Manipulation

In [62]:
test_df = pd.DataFrame({'Age': ['Young', 'Young', 'Young', 'Young', 'Old', 'Old', 'Old', 'Old'],
                        'Actor': ['Jack', 'Arnold', 'Keanu', 'Sylvester', 'Jack', 'Arnold', 'Keanu', 'Sylvester'],
                        'Power': [100, 80, 25, 50, 99, 75, 5, 30]})

test_df.head()

     Age      Actor  Power
0  Young       Jack    100
1  Young     Arnold     80
2  Young      Keanu     25
3  Young  Sylvester     50
4    Old       Jack     99

In [63]:
pivoted_test_df = test_df.pivot(index='Age', columns='Actor', values='Power')
pivoted_test_df

Actor  Arnold  Jack  Keanu  Sylvester
Age
Old        75    99      5         30
Young      80   100     25         50

In [65]:
reshaped_df = df.pivot(index='DATE', columns='TAG', values='POSTS')
reshaped_df

TAG,assembly,c,c#,c++,delphi,go,java,javascript,perl,php,python,r,ruby,swift
DATE,,,,,,,,,,,,,,
2008-07-01,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2008-08-01,8.0,83.0,505.0,164.0,14.0,NaN,222.0,163.0,28.0,158.0,120.0,NaN,70.0,NaN
2008-09-01,28.0,320.0,1640.0,755.0,104.0,NaN,1129.0,634.0,130.0,475.0,538.0,6.0,286.0,NaN
2008-10-01,16.0,303.0,1988.0,807.0,112.0,NaN,1149.0,722.0,128.0,610.0,506.0,NaN,247.0,NaN
2008-11-01,16.0,258.0,1731.0,734.0,141.0,NaN,955.0,580.0,97.0,499.0,449.0,1.0,157.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2023-05-01,174.0,1048.0,3830.0,1779.0,114.0,418.0,4174.0,7767.0,54.0,1970.0,11796.0,2864.0,255.0,996.0
2023-06-01,155.0,890.0,3802.0,1815.0,117.0,520.0,4291.0,7523.0,54.0,1900.0,11273.0,2663.0,226.0,1132.0
2023-07-01,161.0,917.0,3882.0,1853.0,99.0,524.0,4070.0,7541.0,69.0,1744.0,11156.0,2363.0,224.0,1156.0
2023-08-01,144.0,869.0,3659.0,1670.0,106.0,495.0,3847.0,6818.0,48.0,1786.0,10293.0,2359.0,201.0,980.0
2023-09-01,159.0,888.0,3103.0,1524.0,105.0,433.0,3415.0,5833.0,63.0,1698.0,8776.0,2051.0,192.0,887.0

**Challenge**: What are the dimensions of our new dataframe? How many rows and columns does it have? Print out the column names and print out the first 5 rows of the dataframe.

In [66]:
reshaped_df.shape

(183, 14)

In [67]:
reshaped_df.columns

Index(['assembly', 'c', 'c#', 'c++', 'delphi', 'go', 'java', 'javascript',
       'perl', 'php', 'python', 'r', 'ruby', 'swift'],
      dtype='object', name='TAG')

In [68]:
reshaped_df.head()

TAG,assembly,c,c#,c++,delphi,go,java,javascript,perl,php,python,r,ruby,swift
DATE,,,,,,,,,,,,,,
2008-07-01,NaN,NaN,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2008-08-01,8.0,83.0,505.0,164.0,14.0,NaN,222.0,163.0,28.0,158.0,120.0,NaN,70.0,NaN
2008-09-01,28.0,320.0,1640.0,755.0,104.0,NaN,1129.0,634.0,130.0,475.0,538.0,6.0,286.0,NaN
2008-10-01,16.0,303.0,1988.0,807.0,112.0,NaN,1149.0,722.0,128.0,610.0,506.0,NaN,247.0,NaN
2008-11-01,16.0,258.0,1731.0,734.0,141.0,NaN,955.0,580.0,97.0,499.0,449.0,1.0,157.0,NaN

**Challenge**: Count the number of entries per programming language. Why might the number of entries be different?

In [69]:
reshaped_df.count()

TAG
assembly      182
c             182
c#            183
c++           182
delphi        182
go            167
java          182
javascript    182
perl          182
php           182
python        182
r             180
ruby          182
swift         174
dtype: int64

In [71]:
reshaped_df.fillna(0, inplace=True)
reshaped_df

TAG,assembly,c,c#,c++,delphi,go,java,javascript,perl,php,python,r,ruby,swift
DATE,,,,,,,,,,,,,,
2008-07-01,0.0,0.0,3.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2008-08-01,8.0,83.0,505.0,164.0,14.0,0.0,222.0,163.0,28.0,158.0,120.0,0.0,70.0,0.0
2008-09-01,28.0,320.0,1640.0,755.0,104.0,0.0,1129.0,634.0,130.0,475.0,538.0,6.0,286.0,0.0
2008-10-01,16.0,303.0,1988.0,807.0,112.0,0.0,1149.0,722.0,128.0,610.0,506.0,0.0,247.0,0.0
2008-11-01,16.0,258.0,1731.0,734.0,141.0,0.0,955.0,580.0,97.0,499.0,449.0,1.0,157.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2023-05-01,174.0,1048.0,3830.0,1779.0,114.0,418.0,4174.0,7767.0,54.0,1970.0,11796.0,2864.0,255.0,996.0
2023-06-01,155.0,890.0,3802.0,1815.0,117.0,520.0,4291.0,7523.0,54.0,1900.0,11273.0,2663.0,226.0,1132.0
2023-07-01,161.0,917.0,3882.0,1853.0,99.0,524.0,4070.0,7541.0,69.0,1744.0,11156.0,2363.0,224.0,1156.0
2023-08-01,144.0,869.0,3659.0,1670.0,106.0,495.0,3847.0,6818.0,48.0,1786.0,10293.0,2359.0,201.0,980.0
2023-09-01,159.0,888.0,3103.0,1524.0,105.0,433.0,3415.0,5833.0,63.0,1698.0,8776.0,2051.0,192.0,887.0

In [5]:
reshaped_df = reshaped_df.fillna

## Data Visualisaton with with Matplotlib

**Challenge**: Use the [matplotlib documentation](https://matplotlib.org/3.2.1/api/_as_gen/matplotlib.pyplot.plot.html#matplotlib.pyplot.plot) to plot a single programming language (e.g., java) on a chart.

**Challenge**: Show two line (e.g. for Java and Python) on the same chart.

# Smoothing out Time Series Data

Time series data can be quite noisy, with a lot of up and down spikes. To better see a trend we can plot an average of, say 6 or 12 observations. This is called the rolling mean. We calculate the average in a window of time and move it forward by one overservation. Pandas has two handy methods already built in to work this out: [rolling()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rolling.html) and [mean()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.core.window.rolling.Rolling.mean.html).